{
  "backend/main.mo": "Motoko actor implementing authorization, user profiles, and character sheet storage with defaults and permission checks.",
  "feature_evidence.json": "Feature evidence listing two stock-sheet-related features with involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-written summaries describing the purpose of various frontend React, utility, and style files.",
  "frontend/index.css": "Global Tailwind and OKLCH style definitions with light/dark themes and base element styling.",
  "frontend/index.html": "Minimal HTML page bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level component that switches between LoginScreen and StockSheetPage based on authentication state.",
  "frontend/src/components/EditableSheetTable.tsx": "Editable table component supporting inline quantity editing with validation, formatting, and row add/delete.",
  "frontend/src/components/FinalCalculation.tsx": "Displays computed stock totals in a styled card with formatted numeric values.",
  "frontend/src/components/LoginScreen.tsx": "Login screen with Internet Identity sign‑in button and basic layout.",
  "frontend/src/components/SectionCard.tsx": "Card wrapper for stock sheet sections showing a title, content slot, and section total.",
  "frontend/src/components/UserMenu.tsx": "User menu with sign‑out functionality that clears identity and query cache.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating and managing the authenticated backend actor, auto‑initializing access control and refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient and exposing identity, login, logout, and status flags.",
  "frontend/src/hooks/useStockSheet.ts": "Defines conversions between backend CharacterSheet and frontend StockSheet and exposes React Query hooks for loading and saving stock sheet data.",
  "frontend/src/index.css": "Configures Tailwind layers, theme variables, dark mode colors, and print‑optimized styles.",
  "frontend/src/lib/utils.ts": "Exports a utility function combining clsx and tailwind-merge for class name merging.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/StockSheetPage.tsx": "Implements the main stock sheet UI with editing, totals calculation, date selection, save, and print functionality.",
  "frontend/src/types/stockSheet.ts": "Defines TypeScript interfaces for stock sheet rows, sheets, and table columns.",
  "frontend/src/utils/dateKey.ts": "Provides helpers for generating, formatting, parsing, and validating YYYY‑MM‑DD date keys.",
  "frontend/src/utils/defaultSheetState.ts": "Generates default StockSheet arrays with preset item names and quantities.",
  "frontend/src/utils/numberFormat.ts": "Offers numeric parsing, validation, formatting, and rounding to three decimal places.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, clearing, and manipulating URL and sessionStorage parameters including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, theme extensions for colors, typography, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing requirements, architecture notes, known issues, and implemented features for a responsive stock calculation sheet web app."
}