{
  "kind": "build_request",
  "title": "Fix quantity input UX: show placeholder instead of 0.000 and commit whole numbers as .000",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Update all quantity/weight input cells so they do not appear pre-filled with the value \"0.000\" when the stored numeric value is zero; instead, show an empty input with a \"0.000\" placeholder until the user types a value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "there is a premade input of weight 0.000 i have to erase that every time i enter weight fix that (just show me the placeholder)"
        ]
      },
      "acceptanceCriteria": [
        "For any quantity/weight cell whose underlying value is 0, the input renders empty (value=\"\") when not actively being edited.",
        "The input shows placeholder text \"0.000\" for empty quantity/weight cells.",
        "Totals and calculations continue to treat an empty quantity/weight input as numeric 0.",
        "Non-zero quantity/weight values still display as fixed 3-decimal numbers (e.g., 1.500) when not actively editing."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Ensure quantity/weight entry commits reliably even when the user does not type a decimal point: if the user enters a whole number (e.g., \"56\") and then commits the field (blur, Enter, or Save), it must be normalized and stored as 56.000 (3-decimal fixed precision).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "automatically conver number to .000 format if i dont give you the exact decimal (rg if my weight is 56 convert it to 56.000 by yourself) seems like the data is only saved after hitting ."
        ]
      },
      "acceptanceCriteria": [
        "Typing \"56\" into a quantity/weight cell and pressing Enter commits the value as numeric 56.000 (and the UI displays it as 56.000 after commit).",
        "Typing \"56\" into a quantity/weight cell and clicking outside (blur) commits the value as numeric 56.000 (and the UI displays it as 56.000 after commit).",
        "Typing \"56\" into a quantity/weight cell and clicking the page-level Save button without manually typing a decimal point still saves 56.000 to the backend and the value is restored as 56.000 after reload.",
        "The behavior works consistently across all four editable sections (Opening Stock, Purchase, Sales, Suspense)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (shadcn UI components are read-only).",
    "Do not modify immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend architecture as a single Motoko actor (no new backend services)."
  ],
  "nonGoals": [
    "Do not change print layout/styling behavior.",
    "Do not change the sheet data model, snapshot/date behavior, or backend persistence format.",
    "Do not add new validations or error messages beyond what is required to fix placeholder/commit behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}