{
  "kind": "build_request",
  "title": "Fix Save persistence and add date-based sheet history",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Fix the Stock Calculation Sheet Save behavior so that clicking the Save button persists the currently edited sheet for the logged-in user in the Motoko backend (not localStorage), and reloading the page restores the saved data.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "data is not been saved when i click on the save buttuon"
        ]
      },
      "acceptanceCriteria": [
        "After editing any values and clicking Save, refreshing the page keeps the saved values (no reset to defaults).",
        "Saving is scoped to the authenticated Internet Identity Principal (different users do not see each other’s data).",
        "Frontend no longer uses localStorage as the primary persistence layer for sheet save/load.",
        "If the backend save call fails, the UI shows an English error message and does not silently succeed."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add backend support for date-based Stock Calculation Sheet snapshots per user: save and load a sheet for a specific date, and list the dates that have saved data for the current user.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "need a way to go back on dates and access that days data"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes methods to: (1) save a Stock Calculation Sheet for a given date, (2) load a Stock Calculation Sheet for a given date, and (3) list available saved dates for the caller.",
        "Dates are represented as a stable, text-based key (e.g., ISO-like 'YYYY-MM-DD') and are stored per Principal.",
        "If no saved data exists for a requested date, backend returns the default Stock Calculation Sheet state (same defaults the frontend currently uses).",
        "Data survives canister upgrades (use stable state + upgrade hooks as needed under the single-actor architecture)."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add a date selector to the Stock Calculation Sheet page so the user can navigate to a specific date, load that date’s saved sheet, edit it, and save updates back to that same selected date.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "need a way to go back on dates and access that days data"
        ]
      },
      "acceptanceCriteria": [
        "The page provides a clear date selection control (English labels) that defaults to today’s date.",
        "Changing the selected date reloads the sheet data for that date from the backend and updates all four editable sections and the Final Calculation accordingly.",
        "Clicking Save saves the currently displayed sheet to the currently selected date (not always to “today”).",
        "The UI indicates loading/saving states appropriately while switching dates and while saving."
      ]
    }
  ],
  "constraints": [
    "Respect the Internet Computer single-actor backend architecture; keep all Motoko logic in backend/main.mo.",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "All user-facing text added/changed must be in English."
  ],
  "nonGoals": [
    "Do not add third-party auth providers (only Internet Identity).",
    "Do not add real-time sync or collaboration features.",
    "Do not implement external database storage (use canister stable storage only).",
    "Do not change existing print/A5 layout behavior except where needed to accommodate the new date selector in the non-print UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}