{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix sheet persistence via backend and add date-based sheet history UI",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Persist Stock Calculation Sheet save/load in the backend per authenticated user (no localStorage) and show errors on failures.",
      "acceptanceCriteria": [
        "After editing any values and clicking Save, refreshing the page keeps the saved values (no reset to defaults).",
        "Saving is scoped to the authenticated Internet Identity Principal (different users do not see each other’s data).",
        "Frontend no longer uses localStorage as the primary persistence layer for sheet save/load.",
        "If the backend save call fails, the UI shows an English error message and does not silently succeed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useStockSheet.ts",
          "operation": "modify",
          "description": "Replace localStorage-backed load/save with backend actor calls for loading and saving the caller’s sheet data (per Principal) using the existing actor capability; ensure errors are surfaced to the caller (do not swallow failures) and React Query cache is updated/invalidated appropriately. Use the selected \"authorization\" component expectations for authenticated access and handling authorization-related traps gracefully in UI flows; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/StockSheetPage.tsx",
          "operation": "modify",
          "description": "Wire Save to the updated backend-backed save function, ensure initial load comes from the backend-backed query (fall back to the existing default sheet state only when backend returns no data), and show a clear English error message when saving fails (no silent success). Keep existing print/A5 behavior unchanged aside from any non-print UI changes needed later; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Add a date selector that loads/saves Stock Calculation Sheet snapshots for the selected date with proper loading/saving states.",
      "acceptanceCriteria": [
        "The page provides a clear date selection control (English labels) that defaults to today’s date.",
        "Changing the selected date reloads the sheet data for that date from the backend and updates all four editable sections and the Final Calculation accordingly.",
        "Clicking Save saves the currently displayed sheet to the currently selected date (not always to “today”).",
        "The UI indicates loading/saving states appropriately while switching dates and while saving."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/dateKey.ts",
          "operation": "create",
          "description": "Add a small utility to produce and validate a stable, text-based date key (e.g., 'YYYY-MM-DD') for use by the date selector and snapshot load/save calls."
        },
        {
          "path": "frontend/src/hooks/useStockSheet.ts",
          "operation": "modify",
          "description": "Extend the hook to support snapshot-based operations: (1) list available saved dates for the caller, (2) load a sheet for a selected date key, and (3) save updates back to that same selected date key. Provide distinct loading state for date switching vs initial load, and keep save state for the save button; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/StockSheetPage.tsx",
          "operation": "modify",
          "description": "Add a non-print (print:hidden) date selection control in the header with English labeling that defaults to today, triggers reload on change, and ensures Save writes to the currently selected date. Update the print header date display to reflect the selected date (without changing existing print/A5 layout beyond that). Show appropriate loading indicators while switching dates and while saving; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}