{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Quantity input UX: empty-on-zero display + reliable whole-number commit (3 decimals)",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Render quantity/weight cells as empty when the stored numeric value is 0, while showing a \"0.000\" placeholder and preserving numeric-0 behavior for calculations.",
      "acceptanceCriteria": [
        "For any quantity/weight cell whose underlying value is 0, the input renders empty (value=\"\") when not actively being edited.",
        "The input shows placeholder text \"0.000\" for empty quantity/weight cells.",
        "Totals and calculations continue to treat an empty quantity/weight input as numeric 0.",
        "Non-zero quantity/weight values still display as fixed 3-decimal numbers (e.g., 1.500) when not actively editing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EditableSheetTable.tsx",
          "operation": "modify",
          "description": "Adjust quantity cell rendering so that when not actively editing and the stored quantity is 0, the controlled input uses an empty string (\"\"), allowing the existing placeholder \"0.000\" to show. Ensure focus initializes editing with an empty string for zero-valued cells, while non-zero values still display formatted to 3 decimals when not editing. Keep calculations unchanged by continuing to store numeric 0 for committed empty inputs."
        },
        {
          "path": "frontend/src/utils/numberFormat.ts",
          "operation": "modify",
          "description": "Harden normalization utilities used by quantity inputs so empty/placeholder states normalize cleanly to numeric 0 on commit while preserving 3-decimal fixed-precision rounding behavior for non-empty inputs."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Commit quantity/weight edits reliably on Enter, blur, and Save even when users type whole numbers, normalizing to 3-decimal precision (e.g., 56 -> 56.000) across all sections.",
      "acceptanceCriteria": [
        "Typing \"56\" into a quantity/weight cell and pressing Enter commits the value as numeric 56.000 (and the UI displays it as 56.000 after commit).",
        "Typing \"56\" into a quantity/weight cell and clicking outside (blur) commits the value as numeric 56.000 (and the UI displays it as 56.000 after commit).",
        "Typing \"56\" into a quantity/weight cell and clicking the page-level Save button without manually typing a decimal point still saves 56.000 to the backend and the value is restored as 56.000 after reload.",
        "The behavior works consistently across all four editable sections (Opening Stock, Purchase, Sales, Suspense)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EditableSheetTable.tsx",
          "operation": "modify",
          "description": "Ensure quantity edits are normalized and committed for whole-number input (e.g., \"56\") and other valid intermediate states on Enter and blur using the existing normalization flow. Add a parent-invokable way to force-commit any currently edited quantity cell (e.g., via a ref/imperative handle or a commit callback) so Save can flush pending edits before persisting."
        },
        {
          "path": "frontend/src/pages/StockSheetPage.tsx",
          "operation": "modify",
          "description": "Wire Save to force-commit any active/pending quantity edit in each of the four EditableSheetTable instances (Opening Stock, Purchase, Sales, Suspense) before calling saveSheet, preventing cases where clicking Save occurs before the input’s blur-commit runs. Ensure the resulting saved and reloaded values display as fixed 3-decimal numbers."
        },
        {
          "path": "frontend/src/utils/numberFormat.ts",
          "operation": "modify",
          "description": "Confirm normalize-to-3-decimals behavior consistently converts whole numbers (\"56\") to numeric values that display as 56.000 after commit and round to 3 decimals when fractional input is provided."
        }
      ]
    }
  ]
}